GopalSaraf/Practicals/PSDL/include/proc/pic18f47k42.h
// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0x39C2);
#ifndef _LIB_BUILD
asm("PMD2 equ 039C2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCDMD                  :1;
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned                        :2;
        unsigned ADCMD                  :1;
        unsigned DACMD                  :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0x39C2);
// bitfield macros
#define _PMD2_ZCDMD_POSN                                    0x0
#define _PMD2_ZCDMD_POSITION                                0x0
#define _PMD2_ZCDMD_SIZE                                    0x1
#define _PMD2_ZCDMD_LENGTH                                  0x1
#define _PMD2_ZCDMD_MASK                                    0x1
#define _PMD2_CMP1MD_POSN                                   0x1
#define _PMD2_CMP1MD_POSITION                               0x1
#define _PMD2_CMP1MD_SIZE                                   0x1
#define _PMD2_CMP1MD_LENGTH                                 0x1
#define _PMD2_CMP1MD_MASK                                   0x2
#define _PMD2_CMP2MD_POSN                                   0x2
#define _PMD2_CMP2MD_POSITION                               0x2
#define _PMD2_CMP2MD_SIZE                                   0x1
#define _PMD2_CMP2MD_LENGTH                                 0x1
#define _PMD2_CMP2MD_MASK                                   0x4
#define _PMD2_ADCMD_POSN                                    0x5
#define _PMD2_ADCMD_POSITION                                0x5
#define _PMD2_ADCMD_SIZE                                    0x1
#define _PMD2_ADCMD_LENGTH                                  0x1
#define _PMD2_ADCMD_MASK                                    0x20
#define _PMD2_DACMD_POSN                                    0x6
#define _PMD2_DACMD_POSITION                                0x6
#define _PMD2_DACMD_SIZE                                    0x1
#define _PMD2_DACMD_LENGTH                                  0x1
#define _PMD2_DACMD_MASK                                    0x40

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0x39C3);
#ifndef _LIB_BUILD
asm("PMD3 equ 039C3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned CCP3MD                 :1;
        unsigned CCP4MD                 :1;
        unsigned PWM5MD                 :1;
        unsigned PWM6MD                 :1;
        unsigned PWM7MD                 :1;
        unsigned PWM8MD                 :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0x39C3);
// bitfield macros
#define _PMD3_CCP1MD_POSN                                   0x0
#define _PMD3_CCP1MD_POSITION                               0x0
#define _PMD3_CCP1MD_SIZE                                   0x1
#define _PMD3_CCP1MD_LENGTH                                 0x1
#define _PMD3_CCP1MD_MASK                                   0x1
#define _PMD3_CCP2MD_POSN                                   0x1
#define _PMD3_CCP2MD_POSITION                               0x1
#define _PMD3_CCP2MD_SIZE                                   0x1
#define _PMD3_CCP2MD_LENGTH                                 0x1
#define _PMD3_CCP2MD_MASK                                   0x2
#define _PMD3_CCP3MD_POSN                                   0x2
#define _PMD3_CCP3MD_POSITION                               0x2
#define _PMD3_CCP3MD_SIZE                                   0x1
#define _PMD3_CCP3MD_LENGTH                                 0x1
#define _PMD3_CCP3MD_MASK                                   0x4
#define _PMD3_CCP4MD_POSN                                   0x3
#define _PMD3_CCP4MD_POSITION                               0x3
#define _PMD3_CCP4MD_SIZE                                   0x1
#define _PMD3_CCP4MD_LENGTH                                 0x1
#define _PMD3_CCP4MD_MASK                                   0x8
#define _PMD3_PWM5MD_POSN                                   0x4
#define _PMD3_PWM5MD_POSITION                               0x4
#define _PMD3_PWM5MD_SIZE                                   0x1
#define _PMD3_PWM5MD_LENGTH                                 0x1
#define _PMD3_PWM5MD_MASK                                   0x10
#define _PMD3_PWM6MD_POSN                                   0x5
#define _PMD3_PWM6MD_POSITION                               0x5
#define _PMD3_PWM6MD_SIZE                                   0x1
#define _PMD3_PWM6MD_LENGTH                                 0x1
#define _PMD3_PWM6MD_MASK                                   0x20
#define _PMD3_PWM7MD_POSN                                   0x6
#define _PMD3_PWM7MD_POSITION                               0x6
#define _PMD3_PWM7MD_SIZE                                   0x1
#define _PMD3_PWM7MD_LENGTH                                 0x1
#define _PMD3_PWM7MD_MASK                                   0x40
#define _PMD3_PWM8MD_POSN                                   0x7
#define _PMD3_PWM8MD_POSITION                               0x7
#define _PMD3_PWM8MD_SIZE                                   0x1
#define _PMD3_PWM8MD_LENGTH                                 0x1
#define _PMD3_PWM8MD_MASK                                   0x80

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0x39C4);
#ifndef _LIB_BUILD
asm("PMD4 equ 039C4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned CWG1MD                 :1;
        unsigned CWG2MD                 :1;
        unsigned CWG3MD                 :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0x39C4);
// bitfield macros
#define _PMD4_CWG1MD_POSN                                   0x5
#define _PMD4_CWG1MD_POSITION                               0x5
#define _PMD4_CWG1MD_SIZE                                   0x1
#define _PMD4_CWG1MD_LENGTH                                 0x1
#define _PMD4_CWG1MD_MASK                                   0x20
#define _PMD4_CWG2MD_POSN                                   0x6
#define _PMD4_CWG2MD_POSITION                               0x6
#define _PMD4_CWG2MD_SIZE                                   0x1
#define _PMD4_CWG2MD_LENGTH                                 0x1
#define _PMD4_CWG2MD_MASK                                   0x40
#define _PMD4_CWG3MD_POSN                                   0x7
#define _PMD4_CWG3MD_POSITION                               0x7
#define _PMD4_CWG3MD_SIZE                                   0x1
#define _PMD4_CWG3MD_LENGTH                                 0x1
#define _PMD4_CWG3MD_MASK                                   0x80

// Register: PMD5
#define PMD5 PMD5
extern volatile unsigned char           PMD5                __at(0x39C5);
#ifndef _LIB_BUILD
asm("PMD5 equ 039C5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1MD                 :1;
        unsigned I2C2MD                 :1;
        unsigned SPI1MD                 :1;
        unsigned                        :1;
        unsigned U1MD                   :1;
        unsigned U2MD                   :1;
    };
} PMD5bits_t;
extern volatile PMD5bits_t PMD5bits __at(0x39C5);
// bitfield macros
#define _PMD5_I2C1MD_POSN                                   0x0
#define _PMD5_I2C1MD_POSITION                               0x0
#define _PMD5_I2C1MD_SIZE                                   0x1
#define _PMD5_I2C1MD_LENGTH                                 0x1
#define _PMD5_I2C1MD_MASK                                   0x1
#define _PMD5_I2C2MD_POSN                                   0x1
#define _PMD5_I2C2MD_POSITION                               0x1
#define _PMD5_I2C2MD_SIZE                                   0x1
#define _PMD5_I2C2MD_LENGTH                                 0x1
#define _PMD5_I2C2MD_MASK                                   0x2
#define _PMD5_SPI1MD_POSN                                   0x2
#define _PMD5_SPI1MD_POSITION                               0x2
#define _PMD5_SPI1MD_SIZE                                   0x1
#define _PMD5_SPI1MD_LENGTH                                 0x1
#define _PMD5_SPI1MD_MASK                                   0x4
#define _PMD5_U1MD_POSN                                     0x4
#define _PMD5_U1MD_POSITION                                 0x4
#define _PMD5_U1MD_SIZE                                     0x1
#define _PMD5_U1MD_LENGTH                                   0x1
#define _PMD5_U1MD_MASK                                     0x10
#define _PMD5_U2MD_POSN                                     0x5
#define _PMD5_U2MD_POSITION                                 0x5
#define _PMD5_U2MD_SIZE                                     0x1
#define _PMD5_U2MD_LENGTH                                   0x1
#define _PMD5_U2MD_MASK                                     0x20

// Register: PMD6
#define PMD6 PMD6
extern volatile unsigned char           PMD6                __at(0x39C6);
#ifndef _LIB_BUILD
asm("PMD6 equ 039C6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSMMD                  :1;
        unsigned CLC1MD                 :1;
        unsigned CLC2MD                 :1;
        unsigned CLC3MD                 :1;
        unsigned CLC4MD                 :1;
        unsigned SMT1MD                 :1;
    };
} PMD6bits_t;
extern volatile PMD6bits_t PMD6bits __at(0x39C6);
// bitfield macros
#define _PMD6_DSMMD_POSN                                    0x0
#define _PMD6_DSMMD_POSITION                                0x0
#define _PMD6_DSMMD_SIZE                                    0x1
#define _PMD6_DSMMD_LENGTH                                  0x1
#define _PMD6_DSMMD_MASK                                    0x1
#define _PMD6_CLC1MD_POSN                                   0x1
#define _PMD6_CLC1MD_POSITION                               0x1
#define _PMD6_CLC1MD_SIZE                                   0x1
#define _PMD6_CLC1MD_LENGTH                                 0x1
#define _PMD6_CLC1MD_MASK                                   0x2
#define _PMD6_CLC2MD_POSN                                   0x2
#define _PMD6_CLC2MD_POSITION                               0x2
#define _PMD6_CLC2MD_SIZE                                   0x1
#define _PMD6_CLC2MD_LENGTH                                 0x1
#define _PMD6_CLC2MD_MASK                                   0x4
#define _PMD6_CLC3MD_POSN                                   0x3
#define _PMD6_CLC3MD_POSITION                               0x3
#define _PMD6_CLC3MD_SIZE                                   0x1
#define _PMD6_CLC3MD_LENGTH                                 0x1
#define _PMD6_CLC3MD_MASK                                   0x8
#define _PMD6_CLC4MD_POSN                                   0x4
#define _PMD6_CLC4MD_POSITION                               0x4
#define _PMD6_CLC4MD_SIZE                                   0x1
#define _PMD6_CLC4MD_LENGTH                                 0x1
#define _PMD6_CLC4MD_MASK                                   0x10
#define _PMD6_SMT1MD_POSN                                   0x5
#define _PMD6_SMT1MD_POSITION                               0x5
#define _PMD6_SMT1MD_SIZE                                   0x1
#define _PMD6_SMT1MD_LENGTH                                 0x1
#define _PMD6_SMT1MD_MASK                                   0x20

// Register: PMD7
#define PMD7 PMD7
extern volatile unsigned char           PMD7                __at(0x39C7);
#ifndef _LIB_BUILD
asm("PMD7 equ 039C7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1MD                 :1;
        unsigned DMA2MD                 :1;
    };
} PMD7bits_t;
extern volatile PMD7bits_t PMD7bits __at(0x39C7);
// bitfield macros
#define _PMD7_DMA1MD_POSN                                   0x0
#define _PMD7_DMA1MD_POSITION                               0x0
#define _PMD7_DMA1MD_SIZE                                   0x1
#define _PMD7_DMA1MD_LENGTH                                 0x1
#define _PMD7_DMA1MD_MASK                                   0x1
#define _PMD7_DMA2MD_POSN                                   0x1
#define _PMD7_DMA2MD_POSITION                               0x1
#define _PMD7_DMA2MD_SIZE                                   0x1
#define _PMD7_DMA2MD_LENGTH                                 0x1
#define _PMD7_DMA2MD_MASK                                   0x2

// Register: BORCON
#define BORCON BORCON
extern volatile unsigned char           BORCON              __at(0x39D0);
#ifndef _LIB_BUILD
asm("BORCON equ 039D0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BORRDY                 :1;
        unsigned                        :6;
        unsigned SBOREN                 :1;
    };
} BORCONbits_t;
extern volatile BORCONbits_t BORCONbits __at(0x39D0);
// bitfield macros
#define _BORCON_BORRDY_POSN                                 0x0
#define _BORCON_BORRDY_POSITION                             0x0
#define _BORCON_BORRDY_SIZE                                 0x1
#define _BORCON_BORRDY_LENGTH                               0x1
#define _BORCON_BORRDY_MASK                                 0x1
#define _BORCON_SBOREN_POSN                                 0x7
#define _BORCON_SBOREN_POSITION                             0x7
#define _BORCON_SBOREN_SIZE                                 0x1
#define _BORCON_SBOREN_LENGTH                               0x1
#define _BORCON_SBOREN_MASK                                 0x80

// Register: VREGCON
#define VREGCON VREGCON
extern volatile unsigned char           VREGCON             __at(0x39D1);
#ifndef _LIB_BUILD
asm("VREGCON equ 039D1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned VREGPM                 :1;
    };
} VREGCONbits_t;
