GopalSaraf/Practicals/PSDL/include/proc/pic18f47k42.h
extern volatile DMA2SCNTHbits_t DMA2SCNTHbits __at(0x3BD3);
// bitfield macros
#define _DMA2SCNTH_SCNT_POSN                                0x0
#define _DMA2SCNTH_SCNT_POSITION                            0x0
#define _DMA2SCNTH_SCNT_SIZE                                0x4
#define _DMA2SCNTH_SCNT_LENGTH                              0x4
#define _DMA2SCNTH_SCNT_MASK                                0xF
#define _DMA2SCNTH_SCNT8_POSN                               0x0
#define _DMA2SCNTH_SCNT8_POSITION                           0x0
#define _DMA2SCNTH_SCNT8_SIZE                               0x1
#define _DMA2SCNTH_SCNT8_LENGTH                             0x1
#define _DMA2SCNTH_SCNT8_MASK                               0x1
#define _DMA2SCNTH_SCNT9_POSN                               0x1
#define _DMA2SCNTH_SCNT9_POSITION                           0x1
#define _DMA2SCNTH_SCNT9_SIZE                               0x1
#define _DMA2SCNTH_SCNT9_LENGTH                             0x1
#define _DMA2SCNTH_SCNT9_MASK                               0x2
#define _DMA2SCNTH_SCNT10_POSN                              0x2
#define _DMA2SCNTH_SCNT10_POSITION                          0x2
#define _DMA2SCNTH_SCNT10_SIZE                              0x1
#define _DMA2SCNTH_SCNT10_LENGTH                            0x1
#define _DMA2SCNTH_SCNT10_MASK                              0x4
#define _DMA2SCNTH_SCNT11_POSN                              0x3
#define _DMA2SCNTH_SCNT11_POSITION                          0x3
#define _DMA2SCNTH_SCNT11_SIZE                              0x1
#define _DMA2SCNTH_SCNT11_LENGTH                            0x1
#define _DMA2SCNTH_SCNT11_MASK                              0x8
#define _DMA2SCNTH_DMA2SCNT_POSN                            0x0
#define _DMA2SCNTH_DMA2SCNT_POSITION                        0x0
#define _DMA2SCNTH_DMA2SCNT_SIZE                            0x4
#define _DMA2SCNTH_DMA2SCNT_LENGTH                          0x4
#define _DMA2SCNTH_DMA2SCNT_MASK                            0xF
#define _DMA2SCNTH_DMA2SCNT8_POSN                           0x0
#define _DMA2SCNTH_DMA2SCNT8_POSITION                       0x0
#define _DMA2SCNTH_DMA2SCNT8_SIZE                           0x1
#define _DMA2SCNTH_DMA2SCNT8_LENGTH                         0x1
#define _DMA2SCNTH_DMA2SCNT8_MASK                           0x1
#define _DMA2SCNTH_DMA2SCNT9_POSN                           0x1
#define _DMA2SCNTH_DMA2SCNT9_POSITION                       0x1
#define _DMA2SCNTH_DMA2SCNT9_SIZE                           0x1
#define _DMA2SCNTH_DMA2SCNT9_LENGTH                         0x1
#define _DMA2SCNTH_DMA2SCNT9_MASK                           0x2
#define _DMA2SCNTH_DMA2SCNT10_POSN                          0x2
#define _DMA2SCNTH_DMA2SCNT10_POSITION                      0x2
#define _DMA2SCNTH_DMA2SCNT10_SIZE                          0x1
#define _DMA2SCNTH_DMA2SCNT10_LENGTH                        0x1
#define _DMA2SCNTH_DMA2SCNT10_MASK                          0x4
#define _DMA2SCNTH_DMA2SCNT11_POSN                          0x3
#define _DMA2SCNTH_DMA2SCNT11_POSITION                      0x3
#define _DMA2SCNTH_DMA2SCNT11_SIZE                          0x1
#define _DMA2SCNTH_DMA2SCNT11_LENGTH                        0x1
#define _DMA2SCNTH_DMA2SCNT11_MASK                          0x8

// Register: DMA2SPTR
#define DMA2SPTR DMA2SPTR
#ifndef __CCI__
extern volatile __uint24                DMA2SPTR            __at(0x3BD4);
#endif
#ifndef _LIB_BUILD
asm("DMA2SPTR equ 03BD4h");
#endif

// Register: DMA2SPTRL
#define DMA2SPTRL DMA2SPTRL
extern volatile unsigned char           DMA2SPTRL           __at(0x3BD4);
#ifndef _LIB_BUILD
asm("DMA2SPTRL equ 03BD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR0                  :1;
        unsigned SPTR1                  :1;
        unsigned SPTR2                  :1;
        unsigned SPTR3                  :1;
        unsigned SPTR4                  :1;
        unsigned SPTR5                  :1;
        unsigned SPTR6                  :1;
        unsigned SPTR7                  :1;
    };
    struct {
        unsigned DMA2SPTR               :8;
    };
    struct {
        unsigned DMA2SPTR0              :1;
        unsigned DMA2SPTR1              :1;
        unsigned DMA2SPTR2              :1;
        unsigned DMA2SPTR3              :1;
        unsigned DMA2SPTR4              :1;
        unsigned DMA2SPTR5              :1;
        unsigned DMA2SPTR6              :1;
        unsigned DMA2SPTR7              :1;
    };
} DMA2SPTRLbits_t;
extern volatile DMA2SPTRLbits_t DMA2SPTRLbits __at(0x3BD4);
// bitfield macros
#define _DMA2SPTRL_SPTR_POSN                                0x0
#define _DMA2SPTRL_SPTR_POSITION                            0x0
#define _DMA2SPTRL_SPTR_SIZE                                0x8
#define _DMA2SPTRL_SPTR_LENGTH                              0x8
#define _DMA2SPTRL_SPTR_MASK                                0xFF
#define _DMA2SPTRL_SPTR0_POSN                               0x0
#define _DMA2SPTRL_SPTR0_POSITION                           0x0
#define _DMA2SPTRL_SPTR0_SIZE                               0x1
#define _DMA2SPTRL_SPTR0_LENGTH                             0x1
#define _DMA2SPTRL_SPTR0_MASK                               0x1
#define _DMA2SPTRL_SPTR1_POSN                               0x1
#define _DMA2SPTRL_SPTR1_POSITION                           0x1
#define _DMA2SPTRL_SPTR1_SIZE                               0x1
#define _DMA2SPTRL_SPTR1_LENGTH                             0x1
#define _DMA2SPTRL_SPTR1_MASK                               0x2
#define _DMA2SPTRL_SPTR2_POSN                               0x2
#define _DMA2SPTRL_SPTR2_POSITION                           0x2
#define _DMA2SPTRL_SPTR2_SIZE                               0x1
#define _DMA2SPTRL_SPTR2_LENGTH                             0x1
#define _DMA2SPTRL_SPTR2_MASK                               0x4
#define _DMA2SPTRL_SPTR3_POSN                               0x3
#define _DMA2SPTRL_SPTR3_POSITION                           0x3
#define _DMA2SPTRL_SPTR3_SIZE                               0x1
#define _DMA2SPTRL_SPTR3_LENGTH                             0x1
#define _DMA2SPTRL_SPTR3_MASK                               0x8
#define _DMA2SPTRL_SPTR4_POSN                               0x4
#define _DMA2SPTRL_SPTR4_POSITION                           0x4
#define _DMA2SPTRL_SPTR4_SIZE                               0x1
#define _DMA2SPTRL_SPTR4_LENGTH                             0x1
#define _DMA2SPTRL_SPTR4_MASK                               0x10
#define _DMA2SPTRL_SPTR5_POSN                               0x5
#define _DMA2SPTRL_SPTR5_POSITION                           0x5
#define _DMA2SPTRL_SPTR5_SIZE                               0x1
#define _DMA2SPTRL_SPTR5_LENGTH                             0x1
#define _DMA2SPTRL_SPTR5_MASK                               0x20
#define _DMA2SPTRL_SPTR6_POSN                               0x6
#define _DMA2SPTRL_SPTR6_POSITION                           0x6
#define _DMA2SPTRL_SPTR6_SIZE                               0x1
#define _DMA2SPTRL_SPTR6_LENGTH                             0x1
#define _DMA2SPTRL_SPTR6_MASK                               0x40
#define _DMA2SPTRL_SPTR7_POSN                               0x7
#define _DMA2SPTRL_SPTR7_POSITION                           0x7
#define _DMA2SPTRL_SPTR7_SIZE                               0x1
#define _DMA2SPTRL_SPTR7_LENGTH                             0x1
#define _DMA2SPTRL_SPTR7_MASK                               0x80
#define _DMA2SPTRL_DMA2SPTR_POSN                            0x0
#define _DMA2SPTRL_DMA2SPTR_POSITION                        0x0
#define _DMA2SPTRL_DMA2SPTR_SIZE                            0x8
#define _DMA2SPTRL_DMA2SPTR_LENGTH                          0x8
#define _DMA2SPTRL_DMA2SPTR_MASK                            0xFF
#define _DMA2SPTRL_DMA2SPTR0_POSN                           0x0
#define _DMA2SPTRL_DMA2SPTR0_POSITION                       0x0
#define _DMA2SPTRL_DMA2SPTR0_SIZE                           0x1
#define _DMA2SPTRL_DMA2SPTR0_LENGTH                         0x1
#define _DMA2SPTRL_DMA2SPTR0_MASK                           0x1
#define _DMA2SPTRL_DMA2SPTR1_POSN                           0x1
#define _DMA2SPTRL_DMA2SPTR1_POSITION                       0x1
#define _DMA2SPTRL_DMA2SPTR1_SIZE                           0x1
#define _DMA2SPTRL_DMA2SPTR1_LENGTH                         0x1
#define _DMA2SPTRL_DMA2SPTR1_MASK                           0x2
#define _DMA2SPTRL_DMA2SPTR2_POSN                           0x2
#define _DMA2SPTRL_DMA2SPTR2_POSITION                       0x2
#define _DMA2SPTRL_DMA2SPTR2_SIZE                           0x1
#define _DMA2SPTRL_DMA2SPTR2_LENGTH                         0x1
#define _DMA2SPTRL_DMA2SPTR2_MASK                           0x4
#define _DMA2SPTRL_DMA2SPTR3_POSN                           0x3
#define _DMA2SPTRL_DMA2SPTR3_POSITION                       0x3
#define _DMA2SPTRL_DMA2SPTR3_SIZE                           0x1
#define _DMA2SPTRL_DMA2SPTR3_LENGTH                         0x1
#define _DMA2SPTRL_DMA2SPTR3_MASK                           0x8
#define _DMA2SPTRL_DMA2SPTR4_POSN                           0x4
#define _DMA2SPTRL_DMA2SPTR4_POSITION                       0x4
#define _DMA2SPTRL_DMA2SPTR4_SIZE                           0x1
#define _DMA2SPTRL_DMA2SPTR4_LENGTH                         0x1
#define _DMA2SPTRL_DMA2SPTR4_MASK                           0x10
#define _DMA2SPTRL_DMA2SPTR5_POSN                           0x5
#define _DMA2SPTRL_DMA2SPTR5_POSITION                       0x5
#define _DMA2SPTRL_DMA2SPTR5_SIZE                           0x1
#define _DMA2SPTRL_DMA2SPTR5_LENGTH                         0x1
#define _DMA2SPTRL_DMA2SPTR5_MASK                           0x20
#define _DMA2SPTRL_DMA2SPTR6_POSN                           0x6
#define _DMA2SPTRL_DMA2SPTR6_POSITION                       0x6
#define _DMA2SPTRL_DMA2SPTR6_SIZE                           0x1
#define _DMA2SPTRL_DMA2SPTR6_LENGTH                         0x1
#define _DMA2SPTRL_DMA2SPTR6_MASK                           0x40
#define _DMA2SPTRL_DMA2SPTR7_POSN                           0x7
#define _DMA2SPTRL_DMA2SPTR7_POSITION                       0x7
#define _DMA2SPTRL_DMA2SPTR7_SIZE                           0x1
#define _DMA2SPTRL_DMA2SPTR7_LENGTH                         0x1
#define _DMA2SPTRL_DMA2SPTR7_MASK                           0x80

// Register: DMA2SPTRH
#define DMA2SPTRH DMA2SPTRH
extern volatile unsigned char           DMA2SPTRH           __at(0x3BD5);
#ifndef _LIB_BUILD
asm("DMA2SPTRH equ 03BD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR8                  :1;
        unsigned SPTR9                  :1;
        unsigned SPTR10                 :1;
        unsigned SPTR11                 :1;
        unsigned SPTR12                 :1;
        unsigned SPTR13                 :1;
        unsigned SPTR14                 :1;
        unsigned SPTR15                 :1;
    };
    struct {
        unsigned DMA2SPTR               :8;
    };
    struct {
        unsigned DMA2SPTR8              :1;
        unsigned DMA2SPTR9              :1;
        unsigned DMA2SPTR10             :1;
        unsigned DMA2SPTR11             :1;
        unsigned DMA2SPTR12             :1;
        unsigned DMA2SPTR13             :1;
        unsigned DMA2SPTR14             :1;
        unsigned DMA2SPTR15             :1;
    };
} DMA2SPTRHbits_t;
extern volatile DMA2SPTRHbits_t DMA2SPTRHbits __at(0x3BD5);
// bitfield macros
#define _DMA2SPTRH_SPTR_POSN                                0x0
#define _DMA2SPTRH_SPTR_POSITION                            0x0
#define _DMA2SPTRH_SPTR_SIZE                                0x8
#define _DMA2SPTRH_SPTR_LENGTH                              0x8
#define _DMA2SPTRH_SPTR_MASK                                0xFF
#define _DMA2SPTRH_SPTR8_POSN                               0x0
#define _DMA2SPTRH_SPTR8_POSITION                           0x0
#define _DMA2SPTRH_SPTR8_SIZE                               0x1
#define _DMA2SPTRH_SPTR8_LENGTH                             0x1
#define _DMA2SPTRH_SPTR8_MASK                               0x1
#define _DMA2SPTRH_SPTR9_POSN                               0x1
#define _DMA2SPTRH_SPTR9_POSITION                           0x1
#define _DMA2SPTRH_SPTR9_SIZE                               0x1
#define _DMA2SPTRH_SPTR9_LENGTH                             0x1
#define _DMA2SPTRH_SPTR9_MASK                               0x2
#define _DMA2SPTRH_SPTR10_POSN                              0x2
#define _DMA2SPTRH_SPTR10_POSITION                          0x2
#define _DMA2SPTRH_SPTR10_SIZE                              0x1
#define _DMA2SPTRH_SPTR10_LENGTH                            0x1
#define _DMA2SPTRH_SPTR10_MASK                              0x4
#define _DMA2SPTRH_SPTR11_POSN                              0x3
#define _DMA2SPTRH_SPTR11_POSITION                          0x3
#define _DMA2SPTRH_SPTR11_SIZE                              0x1
#define _DMA2SPTRH_SPTR11_LENGTH                            0x1
#define _DMA2SPTRH_SPTR11_MASK                              0x8
#define _DMA2SPTRH_SPTR12_POSN                              0x4
#define _DMA2SPTRH_SPTR12_POSITION                          0x4
#define _DMA2SPTRH_SPTR12_SIZE                              0x1
#define _DMA2SPTRH_SPTR12_LENGTH                            0x1
#define _DMA2SPTRH_SPTR12_MASK                              0x10
#define _DMA2SPTRH_SPTR13_POSN                              0x5
#define _DMA2SPTRH_SPTR13_POSITION                          0x5
#define _DMA2SPTRH_SPTR13_SIZE                              0x1
#define _DMA2SPTRH_SPTR13_LENGTH                            0x1
#define _DMA2SPTRH_SPTR13_MASK                              0x20
#define _DMA2SPTRH_SPTR14_POSN                              0x6
#define _DMA2SPTRH_SPTR14_POSITION                          0x6
#define _DMA2SPTRH_SPTR14_SIZE                              0x1
#define _DMA2SPTRH_SPTR14_LENGTH                            0x1
#define _DMA2SPTRH_SPTR14_MASK                              0x40
#define _DMA2SPTRH_SPTR15_POSN                              0x7
#define _DMA2SPTRH_SPTR15_POSITION                          0x7
#define _DMA2SPTRH_SPTR15_SIZE                              0x1
#define _DMA2SPTRH_SPTR15_LENGTH                            0x1
#define _DMA2SPTRH_SPTR15_MASK                              0x80
#define _DMA2SPTRH_DMA2SPTR_POSN                            0x0
#define _DMA2SPTRH_DMA2SPTR_POSITION                        0x0
#define _DMA2SPTRH_DMA2SPTR_SIZE                            0x8
#define _DMA2SPTRH_DMA2SPTR_LENGTH                          0x8
#define _DMA2SPTRH_DMA2SPTR_MASK                            0xFF
#define _DMA2SPTRH_DMA2SPTR8_POSN                           0x0
#define _DMA2SPTRH_DMA2SPTR8_POSITION                       0x0
#define _DMA2SPTRH_DMA2SPTR8_SIZE                           0x1
#define _DMA2SPTRH_DMA2SPTR8_LENGTH                         0x1
#define _DMA2SPTRH_DMA2SPTR8_MASK                           0x1
#define _DMA2SPTRH_DMA2SPTR9_POSN                           0x1
#define _DMA2SPTRH_DMA2SPTR9_POSITION                       0x1
#define _DMA2SPTRH_DMA2SPTR9_SIZE                           0x1
#define _DMA2SPTRH_DMA2SPTR9_LENGTH                         0x1
#define _DMA2SPTRH_DMA2SPTR9_MASK                           0x2
#define _DMA2SPTRH_DMA2SPTR10_POSN                          0x2
#define _DMA2SPTRH_DMA2SPTR10_POSITION                      0x2
#define _DMA2SPTRH_DMA2SPTR10_SIZE                          0x1
#define _DMA2SPTRH_DMA2SPTR10_LENGTH                        0x1
#define _DMA2SPTRH_DMA2SPTR10_MASK                          0x4
#define _DMA2SPTRH_DMA2SPTR11_POSN                          0x3
#define _DMA2SPTRH_DMA2SPTR11_POSITION                      0x3
#define _DMA2SPTRH_DMA2SPTR11_SIZE                          0x1
#define _DMA2SPTRH_DMA2SPTR11_LENGTH                        0x1
#define _DMA2SPTRH_DMA2SPTR11_MASK                          0x8
#define _DMA2SPTRH_DMA2SPTR12_POSN                          0x4
#define _DMA2SPTRH_DMA2SPTR12_POSITION                      0x4
#define _DMA2SPTRH_DMA2SPTR12_SIZE                          0x1
#define _DMA2SPTRH_DMA2SPTR12_LENGTH                        0x1
#define _DMA2SPTRH_DMA2SPTR12_MASK                          0x10
#define _DMA2SPTRH_DMA2SPTR13_POSN                          0x5
#define _DMA2SPTRH_DMA2SPTR13_POSITION                      0x5
#define _DMA2SPTRH_DMA2SPTR13_SIZE                          0x1
#define _DMA2SPTRH_DMA2SPTR13_LENGTH                        0x1
#define _DMA2SPTRH_DMA2SPTR13_MASK                          0x20
#define _DMA2SPTRH_DMA2SPTR14_POSN                          0x6
#define _DMA2SPTRH_DMA2SPTR14_POSITION                      0x6
#define _DMA2SPTRH_DMA2SPTR14_SIZE                          0x1
#define _DMA2SPTRH_DMA2SPTR14_LENGTH                        0x1
#define _DMA2SPTRH_DMA2SPTR14_MASK                          0x40
#define _DMA2SPTRH_DMA2SPTR15_POSN                          0x7
#define _DMA2SPTRH_DMA2SPTR15_POSITION                      0x7
#define _DMA2SPTRH_DMA2SPTR15_SIZE                          0x1
#define _DMA2SPTRH_DMA2SPTR15_LENGTH                        0x1
#define _DMA2SPTRH_DMA2SPTR15_MASK                          0x80

// Register: DMA2SPTRU
#define DMA2SPTRU DMA2SPTRU
extern volatile unsigned char           DMA2SPTRU           __at(0x3BD6);
#ifndef _LIB_BUILD
asm("DMA2SPTRU equ 03BD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :6;
    };
    struct {
        unsigned SPTR16                 :1;
        unsigned SPTR17                 :1;
        unsigned SPTR18                 :1;
        unsigned SPTR19                 :1;
        unsigned SPTR20                 :1;
        unsigned SPTR21                 :1;
    };
    struct {
        unsigned DMA2SPTR               :6;
    };
    struct {
        unsigned DMA2SPTR16             :1;
        unsigned DMA2SPTR17             :1;
        unsigned DMA2SPTR18             :1;
        unsigned DMA2SPTR19             :1;
        unsigned DMA2SPTR20             :1;
        unsigned DMA2SPTR21             :1;
    };
} DMA2SPTRUbits_t;
extern volatile DMA2SPTRUbits_t DMA2SPTRUbits __at(0x3BD6);
// bitfield macros
#define _DMA2SPTRU_SPTR_POSN                                0x0
#define _DMA2SPTRU_SPTR_POSITION                            0x0
#define _DMA2SPTRU_SPTR_SIZE                                0x6
#define _DMA2SPTRU_SPTR_LENGTH                              0x6
#define _DMA2SPTRU_SPTR_MASK                                0x3F
#define _DMA2SPTRU_SPTR16_POSN                              0x0
#define _DMA2SPTRU_SPTR16_POSITION                          0x0
#define _DMA2SPTRU_SPTR16_SIZE                              0x1
#define _DMA2SPTRU_SPTR16_LENGTH                            0x1
#define _DMA2SPTRU_SPTR16_MASK                              0x1
#define _DMA2SPTRU_SPTR17_POSN                              0x1
#define _DMA2SPTRU_SPTR17_POSITION                          0x1
#define _DMA2SPTRU_SPTR17_SIZE                              0x1
#define _DMA2SPTRU_SPTR17_LENGTH                            0x1
#define _DMA2SPTRU_SPTR17_MASK                              0x2
#define _DMA2SPTRU_SPTR18_POSN                              0x2
#define _DMA2SPTRU_SPTR18_POSITION                          0x2
#define _DMA2SPTRU_SPTR18_SIZE                              0x1
#define _DMA2SPTRU_SPTR18_LENGTH                            0x1
#define _DMA2SPTRU_SPTR18_MASK                              0x4
#define _DMA2SPTRU_SPTR19_POSN                              0x3
#define _DMA2SPTRU_SPTR19_POSITION                          0x3
#define _DMA2SPTRU_SPTR19_SIZE                              0x1
#define _DMA2SPTRU_SPTR19_LENGTH                            0x1
#define _DMA2SPTRU_SPTR19_MASK                              0x8
#define _DMA2SPTRU_SPTR20_POSN                              0x4
#define _DMA2SPTRU_SPTR20_POSITION                          0x4
#define _DMA2SPTRU_SPTR20_SIZE                              0x1
#define _DMA2SPTRU_SPTR20_LENGTH                            0x1
#define _DMA2SPTRU_SPTR20_MASK                              0x10
#define _DMA2SPTRU_SPTR21_POSN                              0x5
#define _DMA2SPTRU_SPTR21_POSITION                          0x5
#define _DMA2SPTRU_SPTR21_SIZE                              0x1
#define _DMA2SPTRU_SPTR21_LENGTH                            0x1
#define _DMA2SPTRU_SPTR21_MASK                              0x20
#define _DMA2SPTRU_DMA2SPTR_POSN                            0x0
#define _DMA2SPTRU_DMA2SPTR_POSITION                        0x0
#define _DMA2SPTRU_DMA2SPTR_SIZE                            0x6
#define _DMA2SPTRU_DMA2SPTR_LENGTH                          0x6
#define _DMA2SPTRU_DMA2SPTR_MASK                            0x3F
#define _DMA2SPTRU_DMA2SPTR16_POSN                          0x0
#define _DMA2SPTRU_DMA2SPTR16_POSITION                      0x0
#define _DMA2SPTRU_DMA2SPTR16_SIZE                          0x1
#define _DMA2SPTRU_DMA2SPTR16_LENGTH                        0x1
#define _DMA2SPTRU_DMA2SPTR16_MASK                          0x1
#define _DMA2SPTRU_DMA2SPTR17_POSN                          0x1
#define _DMA2SPTRU_DMA2SPTR17_POSITION                      0x1
#define _DMA2SPTRU_DMA2SPTR17_SIZE                          0x1
#define _DMA2SPTRU_DMA2SPTR17_LENGTH                        0x1
#define _DMA2SPTRU_DMA2SPTR17_MASK                          0x2
#define _DMA2SPTRU_DMA2SPTR18_POSN                          0x2
#define _DMA2SPTRU_DMA2SPTR18_POSITION                      0x2
#define _DMA2SPTRU_DMA2SPTR18_SIZE                          0x1
#define _DMA2SPTRU_DMA2SPTR18_LENGTH                        0x1
#define _DMA2SPTRU_DMA2SPTR18_MASK                          0x4
#define _DMA2SPTRU_DMA2SPTR19_POSN                          0x3
#define _DMA2SPTRU_DMA2SPTR19_POSITION                      0x3
#define _DMA2SPTRU_DMA2SPTR19_SIZE                          0x1
#define _DMA2SPTRU_DMA2SPTR19_LENGTH                        0x1
#define _DMA2SPTRU_DMA2SPTR19_MASK                          0x8
#define _DMA2SPTRU_DMA2SPTR20_POSN                          0x4
#define _DMA2SPTRU_DMA2SPTR20_POSITION                      0x4
#define _DMA2SPTRU_DMA2SPTR20_SIZE                          0x1
#define _DMA2SPTRU_DMA2SPTR20_LENGTH                        0x1
#define _DMA2SPTRU_DMA2SPTR20_MASK                          0x10
#define _DMA2SPTRU_DMA2SPTR21_POSN                          0x5
#define _DMA2SPTRU_DMA2SPTR21_POSITION                      0x5
#define _DMA2SPTRU_DMA2SPTR21_SIZE                          0x1
#define _DMA2SPTRU_DMA2SPTR21_LENGTH                        0x1
#define _DMA2SPTRU_DMA2SPTR21_MASK                          0x20

// Register: DMA2SSZ
#define DMA2SSZ DMA2SSZ
extern volatile unsigned short          DMA2SSZ             __at(0x3BD7);
#ifndef _LIB_BUILD
asm("DMA2SSZ equ 03BD7h");
#endif

