GopalSaraf/Practicals/PSDL/include/proc/pic18f47k42.h
// Register: PWM8DCH
#define PWM8DCH PWM8DCH
extern volatile unsigned char           PWM8DCH             __at(0x3F61);
#ifndef _LIB_BUILD
asm("PWM8DCH equ 03F61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM8DC2                :1;
        unsigned PWM8DC3                :1;
        unsigned PWM8DC4                :1;
        unsigned PWM8DC5                :1;
        unsigned PWM8DC6                :1;
        unsigned PWM8DC7                :1;
        unsigned PWM8DC8                :1;
        unsigned PWM8DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM8DCHbits_t;
extern volatile PWM8DCHbits_t PWM8DCHbits __at(0x3F61);
// bitfield macros
#define _PWM8DCH_DC_POSN                                    0x0
#define _PWM8DCH_DC_POSITION                                0x0
#define _PWM8DCH_DC_SIZE                                    0x8
#define _PWM8DCH_DC_LENGTH                                  0x8
#define _PWM8DCH_DC_MASK                                    0xFF
#define _PWM8DCH_DC2_POSN                                   0x0
#define _PWM8DCH_DC2_POSITION                               0x0
#define _PWM8DCH_DC2_SIZE                                   0x1
#define _PWM8DCH_DC2_LENGTH                                 0x1
#define _PWM8DCH_DC2_MASK                                   0x1
#define _PWM8DCH_DC3_POSN                                   0x1
#define _PWM8DCH_DC3_POSITION                               0x1
#define _PWM8DCH_DC3_SIZE                                   0x1
#define _PWM8DCH_DC3_LENGTH                                 0x1
#define _PWM8DCH_DC3_MASK                                   0x2
#define _PWM8DCH_DC4_POSN                                   0x2
#define _PWM8DCH_DC4_POSITION                               0x2
#define _PWM8DCH_DC4_SIZE                                   0x1
#define _PWM8DCH_DC4_LENGTH                                 0x1
#define _PWM8DCH_DC4_MASK                                   0x4
#define _PWM8DCH_DC5_POSN                                   0x3
#define _PWM8DCH_DC5_POSITION                               0x3
#define _PWM8DCH_DC5_SIZE                                   0x1
#define _PWM8DCH_DC5_LENGTH                                 0x1
#define _PWM8DCH_DC5_MASK                                   0x8
#define _PWM8DCH_DC6_POSN                                   0x4
#define _PWM8DCH_DC6_POSITION                               0x4
#define _PWM8DCH_DC6_SIZE                                   0x1
#define _PWM8DCH_DC6_LENGTH                                 0x1
#define _PWM8DCH_DC6_MASK                                   0x10
#define _PWM8DCH_DC7_POSN                                   0x5
#define _PWM8DCH_DC7_POSITION                               0x5
#define _PWM8DCH_DC7_SIZE                                   0x1
#define _PWM8DCH_DC7_LENGTH                                 0x1
#define _PWM8DCH_DC7_MASK                                   0x20
#define _PWM8DCH_DC8_POSN                                   0x6
#define _PWM8DCH_DC8_POSITION                               0x6
#define _PWM8DCH_DC8_SIZE                                   0x1
#define _PWM8DCH_DC8_LENGTH                                 0x1
#define _PWM8DCH_DC8_MASK                                   0x40
#define _PWM8DCH_DC9_POSN                                   0x7
#define _PWM8DCH_DC9_POSITION                               0x7
#define _PWM8DCH_DC9_SIZE                                   0x1
#define _PWM8DCH_DC9_LENGTH                                 0x1
#define _PWM8DCH_DC9_MASK                                   0x80
#define _PWM8DCH_PWM8DC2_POSN                               0x0
#define _PWM8DCH_PWM8DC2_POSITION                           0x0
#define _PWM8DCH_PWM8DC2_SIZE                               0x1
#define _PWM8DCH_PWM8DC2_LENGTH                             0x1
#define _PWM8DCH_PWM8DC2_MASK                               0x1
#define _PWM8DCH_PWM8DC3_POSN                               0x1
#define _PWM8DCH_PWM8DC3_POSITION                           0x1
#define _PWM8DCH_PWM8DC3_SIZE                               0x1
#define _PWM8DCH_PWM8DC3_LENGTH                             0x1
#define _PWM8DCH_PWM8DC3_MASK                               0x2
#define _PWM8DCH_PWM8DC4_POSN                               0x2
#define _PWM8DCH_PWM8DC4_POSITION                           0x2
#define _PWM8DCH_PWM8DC4_SIZE                               0x1
#define _PWM8DCH_PWM8DC4_LENGTH                             0x1
#define _PWM8DCH_PWM8DC4_MASK                               0x4
#define _PWM8DCH_PWM8DC5_POSN                               0x3
#define _PWM8DCH_PWM8DC5_POSITION                           0x3
#define _PWM8DCH_PWM8DC5_SIZE                               0x1
#define _PWM8DCH_PWM8DC5_LENGTH                             0x1
#define _PWM8DCH_PWM8DC5_MASK                               0x8
#define _PWM8DCH_PWM8DC6_POSN                               0x4
#define _PWM8DCH_PWM8DC6_POSITION                           0x4
#define _PWM8DCH_PWM8DC6_SIZE                               0x1
#define _PWM8DCH_PWM8DC6_LENGTH                             0x1
#define _PWM8DCH_PWM8DC6_MASK                               0x10
#define _PWM8DCH_PWM8DC7_POSN                               0x5
#define _PWM8DCH_PWM8DC7_POSITION                           0x5
#define _PWM8DCH_PWM8DC7_SIZE                               0x1
#define _PWM8DCH_PWM8DC7_LENGTH                             0x1
#define _PWM8DCH_PWM8DC7_MASK                               0x20
#define _PWM8DCH_PWM8DC8_POSN                               0x6
#define _PWM8DCH_PWM8DC8_POSITION                           0x6
#define _PWM8DCH_PWM8DC8_SIZE                               0x1
#define _PWM8DCH_PWM8DC8_LENGTH                             0x1
#define _PWM8DCH_PWM8DC8_MASK                               0x40
#define _PWM8DCH_PWM8DC9_POSN                               0x7
#define _PWM8DCH_PWM8DC9_POSITION                           0x7
#define _PWM8DCH_PWM8DC9_SIZE                               0x1
#define _PWM8DCH_PWM8DC9_LENGTH                             0x1
#define _PWM8DCH_PWM8DC9_MASK                               0x80
#define _PWM8DCH_PWMPW2_POSN                                0x0
#define _PWM8DCH_PWMPW2_POSITION                            0x0
#define _PWM8DCH_PWMPW2_SIZE                                0x1
#define _PWM8DCH_PWMPW2_LENGTH                              0x1
#define _PWM8DCH_PWMPW2_MASK                                0x1
#define _PWM8DCH_PWMPW3_POSN                                0x1
#define _PWM8DCH_PWMPW3_POSITION                            0x1
#define _PWM8DCH_PWMPW3_SIZE                                0x1
#define _PWM8DCH_PWMPW3_LENGTH                              0x1
#define _PWM8DCH_PWMPW3_MASK                                0x2
#define _PWM8DCH_PWMPW4_POSN                                0x2
#define _PWM8DCH_PWMPW4_POSITION                            0x2
#define _PWM8DCH_PWMPW4_SIZE                                0x1
#define _PWM8DCH_PWMPW4_LENGTH                              0x1
#define _PWM8DCH_PWMPW4_MASK                                0x4
#define _PWM8DCH_PWMPW5_POSN                                0x3
#define _PWM8DCH_PWMPW5_POSITION                            0x3
#define _PWM8DCH_PWMPW5_SIZE                                0x1
#define _PWM8DCH_PWMPW5_LENGTH                              0x1
#define _PWM8DCH_PWMPW5_MASK                                0x8
#define _PWM8DCH_PWMPW6_POSN                                0x4
#define _PWM8DCH_PWMPW6_POSITION                            0x4
#define _PWM8DCH_PWMPW6_SIZE                                0x1
#define _PWM8DCH_PWMPW6_LENGTH                              0x1
#define _PWM8DCH_PWMPW6_MASK                                0x10
#define _PWM8DCH_PWMPW7_POSN                                0x5
#define _PWM8DCH_PWMPW7_POSITION                            0x5
#define _PWM8DCH_PWMPW7_SIZE                                0x1
#define _PWM8DCH_PWMPW7_LENGTH                              0x1
#define _PWM8DCH_PWMPW7_MASK                                0x20
#define _PWM8DCH_PWMPW8_POSN                                0x6
#define _PWM8DCH_PWMPW8_POSITION                            0x6
#define _PWM8DCH_PWMPW8_SIZE                                0x1
#define _PWM8DCH_PWMPW8_LENGTH                              0x1
#define _PWM8DCH_PWMPW8_MASK                                0x40
#define _PWM8DCH_PWMPW9_POSN                                0x7
#define _PWM8DCH_PWMPW9_POSITION                            0x7
#define _PWM8DCH_PWMPW9_SIZE                                0x1
#define _PWM8DCH_PWMPW9_LENGTH                              0x1
#define _PWM8DCH_PWMPW9_MASK                                0x80

