GopalSaraf/Practicals/PSDL/include/proc/pic18f47k42.h
#define                                 T6CKPS1_bit         _BIT_ACCESS(T6CON,5)
// T6CON<T6CKPS2>
extern volatile __bit                   T6CKPS2             __at(0x1FCA6);	// @ (0x3F94 * 8 + 6)
#define                                 T6CKPS2_bit         _BIT_ACCESS(T6CON,6)
// T6HLT<T6CKSYNC>
extern volatile __bit                   T6CKSYNC            __at(0x1FCAD);	// @ (0x3F95 * 8 + 5)
#define                                 T6CKSYNC_bit        _BIT_ACCESS(T6HLT,5)
// T6CLKCON<T6CS0>
extern volatile __bit                   T6CS0               __at(0x1FCB0);	// @ (0x3F96 * 8 + 0)
#define                                 T6CS0_bit           _BIT_ACCESS(T6CLKCON,0)
// T6CLKCON<T6CS1>
extern volatile __bit                   T6CS1               __at(0x1FCB1);	// @ (0x3F96 * 8 + 1)
#define                                 T6CS1_bit           _BIT_ACCESS(T6CLKCON,1)
// T6CLKCON<T6CS2>
extern volatile __bit                   T6CS2               __at(0x1FCB2);	// @ (0x3F96 * 8 + 2)
#define                                 T6CS2_bit           _BIT_ACCESS(T6CLKCON,2)
// T6CLKCON<T6CS3>
extern volatile __bit                   T6CS3               __at(0x1FCB3);	// @ (0x3F96 * 8 + 3)
#define                                 T6CS3_bit           _BIT_ACCESS(T6CLKCON,3)
// T6HLT<T6MODE0>
extern volatile __bit                   T6MODE0             __at(0x1FCA8);	// @ (0x3F95 * 8 + 0)
#define                                 T6MODE0_bit         _BIT_ACCESS(T6HLT,0)
// T6HLT<T6MODE1>
extern volatile __bit                   T6MODE1             __at(0x1FCA9);	// @ (0x3F95 * 8 + 1)
#define                                 T6MODE1_bit         _BIT_ACCESS(T6HLT,1)
// T6HLT<T6MODE2>
extern volatile __bit                   T6MODE2             __at(0x1FCAA);	// @ (0x3F95 * 8 + 2)
#define                                 T6MODE2_bit         _BIT_ACCESS(T6HLT,2)
// T6HLT<T6MODE3>
extern volatile __bit                   T6MODE3             __at(0x1FCAB);	// @ (0x3F95 * 8 + 3)
#define                                 T6MODE3_bit         _BIT_ACCESS(T6HLT,3)
// T6HLT<T6MODE4>
extern volatile __bit                   T6MODE4             __at(0x1FCAC);	// @ (0x3F95 * 8 + 4)
#define                                 T6MODE4_bit         _BIT_ACCESS(T6HLT,4)
// T6CON<T6ON>
extern volatile __bit                   T6ON                __at(0x1FCA7);	// @ (0x3F94 * 8 + 7)
#define                                 T6ON_bit            _BIT_ACCESS(T6CON,7)
// T6CON<T6OUTPS0>
extern volatile __bit                   T6OUTPS0            __at(0x1FCA0);	// @ (0x3F94 * 8 + 0)
#define                                 T6OUTPS0_bit        _BIT_ACCESS(T6CON,0)
// T6CON<T6OUTPS1>
extern volatile __bit                   T6OUTPS1            __at(0x1FCA1);	// @ (0x3F94 * 8 + 1)
#define                                 T6OUTPS1_bit        _BIT_ACCESS(T6CON,1)
// T6CON<T6OUTPS2>
extern volatile __bit                   T6OUTPS2            __at(0x1FCA2);	// @ (0x3F94 * 8 + 2)
#define                                 T6OUTPS2_bit        _BIT_ACCESS(T6CON,2)
// T6CON<T6OUTPS3>
extern volatile __bit                   T6OUTPS3            __at(0x1FCA3);	// @ (0x3F94 * 8 + 3)
#define                                 T6OUTPS3_bit        _BIT_ACCESS(T6CON,3)
// T6HLT<T6PSYNC>
extern volatile __bit                   T6PSYNC             __at(0x1FCAF);	// @ (0x3F95 * 8 + 7)
#define                                 T6PSYNC_bit         _BIT_ACCESS(T6HLT,7)
// T6RST<T6RSEL0>
extern volatile __bit                   T6RSEL0             __at(0x1FCB8);	// @ (0x3F97 * 8 + 0)
#define                                 T6RSEL0_bit         _BIT_ACCESS(T6RST,0)
// T6RST<T6RSEL1>
extern volatile __bit                   T6RSEL1             __at(0x1FCB9);	// @ (0x3F97 * 8 + 1)
#define                                 T6RSEL1_bit         _BIT_ACCESS(T6RST,1)
// T6RST<T6RSEL2>
extern volatile __bit                   T6RSEL2             __at(0x1FCBA);	// @ (0x3F97 * 8 + 2)
#define                                 T6RSEL2_bit         _BIT_ACCESS(T6RST,2)
// T6RST<T6RSEL3>
extern volatile __bit                   T6RSEL3             __at(0x1FCBB);	// @ (0x3F97 * 8 + 3)
#define                                 T6RSEL3_bit         _BIT_ACCESS(T6RST,3)
// T6RST<T6RSEL4>
extern volatile __bit                   T6RSEL4             __at(0x1FCBC);	// @ (0x3F97 * 8 + 4)
#define                                 T6RSEL4_bit         _BIT_ACCESS(T6RST,4)
// SPI1INTE<TCZIE>
extern volatile __bit                   TCZIE               __at(0x1E8DE);	// @ (0x3D1B * 8 + 6)
#define                                 TCZIE_bit           _BIT_ACCESS(SPI1INTE,6)
// SPI1INTF<TCZIF>
extern volatile __bit                   TCZIF               __at(0x1E8D6);	// @ (0x3D1A * 8 + 6)
#define                                 TCZIF_bit           _BIT_ACCESS(SPI1INTF,6)
// ADCON3<TMD0>
extern volatile __bit                   TMD0                __at(0x1F7D8);	// @ (0x3EFB * 8 + 0)
#define                                 TMD0_bit            _BIT_ACCESS(ADCON3,0)
// ADCON3<TMD1>
extern volatile __bit                   TMD1                __at(0x1F7D9);	// @ (0x3EFB * 8 + 1)
#define                                 TMD1_bit            _BIT_ACCESS(ADCON3,1)
// ADCON3<TMD2>
extern volatile __bit                   TMD2                __at(0x1F7DA);	// @ (0x3EFB * 8 + 2)
#define                                 TMD2_bit            _BIT_ACCESS(ADCON3,2)
// TMR0H<TMR0H0>
extern volatile __bit                   TMR0H0              __at(0x1FDB8);	// @ (0x3FB7 * 8 + 0)
#define                                 TMR0H0_bit          _BIT_ACCESS(TMR0H,0)
// TMR0H<TMR0H1>
extern volatile __bit                   TMR0H1              __at(0x1FDB9);	// @ (0x3FB7 * 8 + 1)
#define                                 TMR0H1_bit          _BIT_ACCESS(TMR0H,1)
// TMR0H<TMR0H2>
extern volatile __bit                   TMR0H2              __at(0x1FDBA);	// @ (0x3FB7 * 8 + 2)
#define                                 TMR0H2_bit          _BIT_ACCESS(TMR0H,2)
// TMR0H<TMR0H3>
extern volatile __bit                   TMR0H3              __at(0x1FDBB);	// @ (0x3FB7 * 8 + 3)
#define                                 TMR0H3_bit          _BIT_ACCESS(TMR0H,3)
// TMR0H<TMR0H4>
extern volatile __bit                   TMR0H4              __at(0x1FDBC);	// @ (0x3FB7 * 8 + 4)
#define                                 TMR0H4_bit          _BIT_ACCESS(TMR0H,4)
// TMR0H<TMR0H5>
extern volatile __bit                   TMR0H5              __at(0x1FDBD);	// @ (0x3FB7 * 8 + 5)
#define                                 TMR0H5_bit          _BIT_ACCESS(TMR0H,5)
// TMR0H<TMR0H6>
extern volatile __bit                   TMR0H6              __at(0x1FDBE);	// @ (0x3FB7 * 8 + 6)
#define                                 TMR0H6_bit          _BIT_ACCESS(TMR0H,6)
// TMR0H<TMR0H7>
extern volatile __bit                   TMR0H7              __at(0x1FDBF);	// @ (0x3FB7 * 8 + 7)
#define                                 TMR0H7_bit          _BIT_ACCESS(TMR0H,7)
// PIE3<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x1CC9F);	// @ (0x3993 * 8 + 7)
#define                                 TMR0IE_bit          _BIT_ACCESS(PIE3,7)
// PIR3<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x1CD1F);	// @ (0x39A3 * 8 + 7)
#define                                 TMR0IF_bit          _BIT_ACCESS(PIR3,7)
// IPR3<TMR0IP>
extern volatile __bit                   TMR0IP              __at(0x1CC1F);	// @ (0x3983 * 8 + 7)
#define                                 TMR0IP_bit          _BIT_ACCESS(IPR3,7)
// TMR0L<TMR0L0>
extern volatile __bit                   TMR0L0              __at(0x1FDB0);	// @ (0x3FB6 * 8 + 0)
#define                                 TMR0L0_bit          _BIT_ACCESS(TMR0L,0)
// TMR0L<TMR0L1>
extern volatile __bit                   TMR0L1              __at(0x1FDB1);	// @ (0x3FB6 * 8 + 1)
#define                                 TMR0L1_bit          _BIT_ACCESS(TMR0L,1)
// TMR0L<TMR0L2>
extern volatile __bit                   TMR0L2              __at(0x1FDB2);	// @ (0x3FB6 * 8 + 2)
#define                                 TMR0L2_bit          _BIT_ACCESS(TMR0L,2)
// TMR0L<TMR0L3>
extern volatile __bit                   TMR0L3              __at(0x1FDB3);	// @ (0x3FB6 * 8 + 3)
#define                                 TMR0L3_bit          _BIT_ACCESS(TMR0L,3)
// TMR0L<TMR0L4>
extern volatile __bit                   TMR0L4              __at(0x1FDB4);	// @ (0x3FB6 * 8 + 4)
#define                                 TMR0L4_bit          _BIT_ACCESS(TMR0L,4)
// TMR0L<TMR0L5>
extern volatile __bit                   TMR0L5              __at(0x1FDB5);	// @ (0x3FB6 * 8 + 5)
#define                                 TMR0L5_bit          _BIT_ACCESS(TMR0L,5)
// TMR0L<TMR0L6>
extern volatile __bit                   TMR0L6              __at(0x1FDB6);	// @ (0x3FB6 * 8 + 6)
#define                                 TMR0L6_bit          _BIT_ACCESS(TMR0L,6)
// TMR0L<TMR0L7>
extern volatile __bit                   TMR0L7              __at(0x1FDB7);	// @ (0x3FB6 * 8 + 7)
#define                                 TMR0L7_bit          _BIT_ACCESS(TMR0L,7)
// PMD1<TMR0MD>
extern volatile __bit                   TMR0MD              __at(0x1CE08);	// @ (0x39C1 * 8 + 0)
#define                                 TMR0MD_bit          _BIT_ACCESS(PMD1,0)
// SMT1TMRL<TMR1>
extern volatile __bit                   TMR1                __at(0x1F891);	// @ (0x3F12 * 8 + 1)
#define                                 TMR1_bit            _BIT_ACCESS(SMT1TMRL,1)
// SMT1TMRH<TMR10>
extern volatile __bit                   TMR10               __at(0x1F89A);	// @ (0x3F13 * 8 + 2)
#define                                 TMR10_bit           _BIT_ACCESS(SMT1TMRH,2)
// SMT1TMRH<TMR11>
extern volatile __bit                   TMR11               __at(0x1F89B);	// @ (0x3F13 * 8 + 3)
#define                                 TMR11_bit           _BIT_ACCESS(SMT1TMRH,3)
// SMT1TMRH<TMR12>
extern volatile __bit                   TMR12               __at(0x1F89C);	// @ (0x3F13 * 8 + 4)
#define                                 TMR12_bit           _BIT_ACCESS(SMT1TMRH,4)
// SMT1TMRH<TMR13>
extern volatile __bit                   TMR13               __at(0x1F89D);	// @ (0x3F13 * 8 + 5)
#define                                 TMR13_bit           _BIT_ACCESS(SMT1TMRH,5)
// SMT1TMRH<TMR14>
extern volatile __bit                   TMR14               __at(0x1F89E);	// @ (0x3F13 * 8 + 6)
#define                                 TMR14_bit           _BIT_ACCESS(SMT1TMRH,6)
// SMT1TMRH<TMR15>
extern volatile __bit                   TMR15               __at(0x1F89F);	// @ (0x3F13 * 8 + 7)
#define                                 TMR15_bit           _BIT_ACCESS(SMT1TMRH,7)
// SMT1TMRU<TMR16>
extern volatile __bit                   TMR16               __at(0x1F8A0);	// @ (0x3F14 * 8 + 0)
#define                                 TMR16_bit           _BIT_ACCESS(SMT1TMRU,0)
// SMT1TMRU<TMR17>
extern volatile __bit                   TMR17               __at(0x1F8A1);	// @ (0x3F14 * 8 + 1)
#define                                 TMR17_bit           _BIT_ACCESS(SMT1TMRU,1)
// SMT1TMRU<TMR18>
extern volatile __bit                   TMR18               __at(0x1F8A2);	// @ (0x3F14 * 8 + 2)
#define                                 TMR18_bit           _BIT_ACCESS(SMT1TMRU,2)
// SMT1TMRU<TMR19>
extern volatile __bit                   TMR19               __at(0x1F8A3);	// @ (0x3F14 * 8 + 3)
#define                                 TMR19_bit           _BIT_ACCESS(SMT1TMRU,3)
// PIE4<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x1CCA1);	// @ (0x3994 * 8 + 1)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE4,1)
// PIR4<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x1CD21);	// @ (0x39A4 * 8 + 1)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR4,1)
// IPR4<TMR1GIP>
extern volatile __bit                   TMR1GIP             __at(0x1CC21);	// @ (0x3984 * 8 + 1)
#define                                 TMR1GIP_bit         _BIT_ACCESS(IPR4,1)
// TMR1H<TMR1H0>
extern volatile __bit                   TMR1H0              __at(0x1FD88);	// @ (0x3FB1 * 8 + 0)
#define                                 TMR1H0_bit          _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR1H1>
extern volatile __bit                   TMR1H1              __at(0x1FD89);	// @ (0x3FB1 * 8 + 1)
#define                                 TMR1H1_bit          _BIT_ACCESS(TMR1H,1)
// TMR1H<TMR1H2>
extern volatile __bit                   TMR1H2              __at(0x1FD8A);	// @ (0x3FB1 * 8 + 2)
#define                                 TMR1H2_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR1H3>
extern volatile __bit                   TMR1H3              __at(0x1FD8B);	// @ (0x3FB1 * 8 + 3)
#define                                 TMR1H3_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR1H4>
extern volatile __bit                   TMR1H4              __at(0x1FD8C);	// @ (0x3FB1 * 8 + 4)
#define                                 TMR1H4_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR1H5>
extern volatile __bit                   TMR1H5              __at(0x1FD8D);	// @ (0x3FB1 * 8 + 5)
#define                                 TMR1H5_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR1H6>
extern volatile __bit                   TMR1H6              __at(0x1FD8E);	// @ (0x3FB1 * 8 + 6)
#define                                 TMR1H6_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR1H7>
extern volatile __bit                   TMR1H7              __at(0x1FD8F);	// @ (0x3FB1 * 8 + 7)
#define                                 TMR1H7_bit          _BIT_ACCESS(TMR1H,7)
// PIE4<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x1CCA0);	// @ (0x3994 * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x1CD20);	// @ (0x39A4 * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<TMR1IP>
extern volatile __bit                   TMR1IP              __at(0x1CC20);	// @ (0x3984 * 8 + 0)
#define                                 TMR1IP_bit          _BIT_ACCESS(IPR4,0)
// TMR1L<TMR1L0>
extern volatile __bit                   TMR1L0              __at(0x1FD80);	// @ (0x3FB0 * 8 + 0)
#define                                 TMR1L0_bit          _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR1L1>
extern volatile __bit                   TMR1L1              __at(0x1FD81);	// @ (0x3FB0 * 8 + 1)
#define                                 TMR1L1_bit          _BIT_ACCESS(TMR1L,1)
// TMR1L<TMR1L2>
extern volatile __bit                   TMR1L2              __at(0x1FD82);	// @ (0x3FB0 * 8 + 2)
#define                                 TMR1L2_bit          _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR1L3>
extern volatile __bit                   TMR1L3              __at(0x1FD83);	// @ (0x3FB0 * 8 + 3)
#define                                 TMR1L3_bit          _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR1L4>
extern volatile __bit                   TMR1L4              __at(0x1FD84);	// @ (0x3FB0 * 8 + 4)
#define                                 TMR1L4_bit          _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR1L5>
extern volatile __bit                   TMR1L5              __at(0x1FD85);	// @ (0x3FB0 * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x1FD86);	// @ (0x3FB0 * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x1FD87);	// @ (0x3FB0 * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x1CE09);	// @ (0x39C1 * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x1FD90);	// @ (0x3FB2 * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// SMT1TMRU<TMR20>
extern volatile __bit                   TMR20               __at(0x1F8A4);	// @ (0x3F14 * 8 + 4)
#define                                 TMR20_bit           _BIT_ACCESS(SMT1TMRU,4)
// SMT1TMRU<TMR21>
extern volatile __bit                   TMR21               __at(0x1F8A5);	// @ (0x3F14 * 8 + 5)
#define                                 TMR21_bit           _BIT_ACCESS(SMT1TMRU,5)
// SMT1TMRU<TMR22>
extern volatile __bit                   TMR22               __at(0x1F8A6);	// @ (0x3F14 * 8 + 6)
#define                                 TMR22_bit           _BIT_ACCESS(SMT1TMRU,6)
// SMT1TMRU<TMR23>
extern volatile __bit                   TMR23               __at(0x1F8A7);	// @ (0x3F14 * 8 + 7)
#define                                 TMR23_bit           _BIT_ACCESS(SMT1TMRU,7)
// PIE4<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x1CCA2);	// @ (0x3994 * 8 + 2)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x1CD22);	// @ (0x39A4 * 8 + 2)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<TMR2IP>
extern volatile __bit                   TMR2IP              __at(0x1CC22);	// @ (0x3984 * 8 + 2)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR4,2)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x1CE0A);	// @ (0x39C1 * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x1FD67);	// @ (0x3FAC * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// SMT1TMRL<TMR3>
extern volatile __bit                   TMR3                __at(0x1F893);	// @ (0x3F12 * 8 + 3)
#define                                 TMR3_bit            _BIT_ACCESS(SMT1TMRL,3)
// PIE6<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x1CCB7);	// @ (0x3996 * 8 + 7)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE6,7)
// PIR6<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x1CD37);	// @ (0x39A6 * 8 + 7)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR6,7)
// IPR6<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x1CC37);	// @ (0x3986 * 8 + 7)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR6,7)
// TMR3H<TMR3H0>
extern volatile __bit                   TMR3H0              __at(0x1FD28);	// @ (0x3FA5 * 8 + 0)
#define                                 TMR3H0_bit          _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR3H1>
extern volatile __bit                   TMR3H1              __at(0x1FD29);	// @ (0x3FA5 * 8 + 1)
#define                                 TMR3H1_bit          _BIT_ACCESS(TMR3H,1)
// TMR3H<TMR3H2>
extern volatile __bit                   TMR3H2              __at(0x1FD2A);	// @ (0x3FA5 * 8 + 2)
#define                                 TMR3H2_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR3H3>
extern volatile __bit                   TMR3H3              __at(0x1FD2B);	// @ (0x3FA5 * 8 + 3)
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x1FD2C);	// @ (0x3FA5 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
extern volatile __bit                   TMR3H5              __at(0x1FD2D);	// @ (0x3FA5 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x1FD2E);	// @ (0x3FA5 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x1FD2F);	// @ (0x3FA5 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE6<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x1CCB6);	// @ (0x3996 * 8 + 6)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE6,6)
// PIR6<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x1CD36);	// @ (0x39A6 * 8 + 6)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR6,6)
// IPR6<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x1CC36);	// @ (0x3986 * 8 + 6)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR6,6)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1FD20);	// @ (0x3FA4 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1FD21);	// @ (0x3FA4 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x1FD22);	// @ (0x3FA4 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x1FD23);	// @ (0x3FA4 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x1FD24);	// @ (0x3FA4 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x1FD25);	// @ (0x3FA4 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x1FD26);	// @ (0x3FA4 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x1FD27);	// @ (0x3FA4 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x1CE0B);	// @ (0x39C1 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1FD30);	// @ (0x3FA6 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE7<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x1CCB8);	// @ (0x3997 * 8 + 0)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE7,0)
// PIR7<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x1CD38);	// @ (0x39A7 * 8 + 0)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR7,0)
// IPR7<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x1CC38);	// @ (0x3987 * 8 + 0)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR7,0)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x1CE0C);	// @ (0x39C1 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x1FD07);	// @ (0x3FA0 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// SMT1TMRL<TMR5>
extern volatile __bit                   TMR5                __at(0x1F895);	// @ (0x3F12 * 8 + 5)
#define                                 TMR5_bit            _BIT_ACCESS(SMT1TMRL,5)
// PIE8<TMR5GIE>
